[
    {
      "eventId": 1,
      "name": "CES 2023",
      "brief": "CES is the most influential tech event in the world — the proving ground for breakthrough technologies and global innovators. This is where the world's biggest brands do business and meet new partners.",
      "imageURL":"https://cdn.ces.tech/ces/media/logos-and-icons/2023/cescta_combologo_clr_350x121.png?width=350&height=121",
      "detail": "CES is the most influential tech event in the world — the proving ground for breakthrough technologies and global innovators. This is where the world's biggest brands do business and meet new partners, and the sharpest innovators hit the stage. Owned and produced by the Consumer Technology Association (CTA)®, CES features every aspect of the tech sector.\n\nCES showcases companies including manufacturers, developers and suppliers of consumer technology hardware, content, technology delivery systems and more.\n\nIt also includes a conference program where the world's business leaders and pioneering thinkers address the industry's most relevant issues.\n\nFind out more about the thought leaders and industry innovators who will be at CES 2023."
    },
    {
      "eventId": 2,
      "name": "WWDC 2023",
      "brief": "The Apple Worldwide Developers Conference kicks off with exciting reveals, inspiration, and new opportunities. Join the worldwide developer community for an in-depth look at the future of Apple platforms, directly from Apple Park.",
      "imageURL": "https://www.apple.com/newsroom/images/live-action/wwdc-2021/Apple_WWDC21-details-announcement_052421_big.jpg.large.jpg",
      "detail": "The Worldwide Developers Conference (WWDC) is an information technology conference held annually by Apple Inc. The conference is usually held at Apple Park in California. The event is usually used to showcase new software and technologies in the macOS, iOS, iPadOS, watchOS, and tvOS families as well as other Apple software. WWDC is also an event hosted for third-party software developers that work on apps for iPhones, iPads, Macs, and other Apple devices. Attendees can participate in hands-on labs with Apple engineers and attend in-depth sessions covering a wide variety of topics.\n\nThe first ever WWDC was held in 1983, with the introduction of Apple Basic, but it was not until 2002 that Apple started using the conference as a major launchpad for new products. Beginning in 1987, WWDC was held in Santa Clara. After 15 years in nearby San Jose, the conference moved to San Francisco, where it eventually became Apple's primary media event of the year and regularly sold out. WWDC returned to San Jose 13 years later.\n\nWWDC 2020 and WWDC 2021* were hosted as online-only conferences due to the COVID-19 pandemic. WWDC22 invited developers and press back into Steve Jobs theater for the first time in about three years despite the COVID-19 pandemic. Customers and consumers watched the event via an online live streams. All of these events were hosted at Apple Park in Cupertino, California.\n\n"
    },
    {
      "eventId": 3,
      "name": "I/O 2023",
      "brief": "Google's flagship event connects developers from around the world for thoughtful discussions, insights from Google experts, and a first look at the latest developer products.",
      "imageURL": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSD_5Epz0opQi4hXDJVc1ueMN8-y2JdSm1Y9qUjVZRzMBIjwnfV-0CXtRR7295SjCeUPlo&usqp=CAU",
      "detail": "Google's flagship event connects developers from around the world for thoughtful discussions, insights from Google experts, and a first look at the latest developer products.\n\nAll content at I/O is virtual and free for everyone. You can save content to My I/O and your developer profile dashboard throughout the two-day event and watch on demand at your convenience. The keynotes focus on company and product news, while technical sessions focus on product announcements and updates.\n\nGrow your knowledge in the I/O 2022 Learning Lab with resources about the Google technology you love or want to learn more about. Codelabs and learning pathways are always-on, self-guided learning experiences that help you adopt Google technology. Earn developer profile badges for completing select learning pathways.\n\n"
    },
    {
      "eventId": 4,
      "name": "Build 2023",
      "brief": "Microsoft Build is an annual conference event held by Microsoft, aimed at software engineers and web developers using Windows, Microsoft Azure and other Microsoft technologies.",
      "imageURL": "https://images.news18.com/ibnlive/uploads/2022/03/microsoft-build-dates-164871138816x9.jpg",
      "detail": "Microsoft Build (often stylised as //build/) is an annual conference event held by Microsoft, aimed at software engineers and web developers using Windows, Microsoft Azure and other Microsoft technologies. First held in 2011, it serves as a successor for Microsoft's previous developer events, the Professional Developers Conference (an infrequent event which covered development of software for the Windows operating system) and MIX (which covered web development centering on Microsoft technology such as Silverlight and ASP.net). The attendee price was (US)$2,195 in 2016, up from $2,095 in 2015. It sold out quickly, within one minute of the registration site opening in 2016.\n\nThe event has been held at a large convention center, or purpose-built meeting space on the Microsoft Campus. The Keynote on the first day has been led by the Microsoft CEO addressing the press and developers. It has been the place to announce the general technology milestones for developers. There are breakout sessions conducted by engineers and program managers, most often Microsoft employees representing their particular initiatives. The keynote on the second day often includes deeper dives into technology. Thousands of developers and technologists from all over the world attend.\n\nBuild 2011 was held from September 13 to September 16, 2011 in Anaheim, California.\n\n The conference heavily focused on Windows 8, Windows Server 2012 and Visual Studio 2012; their Developer Preview versions were also released during the conference. Attendees also received a Samsung tablet shipping with the Windows 8 'Developer Preview' build.\n\n"
    }
  ]
  